RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7xx_HAL/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h7b3xxq.s
;/******************************************************************************
;* @file    startup_stm32h7b3xxq.s
;* @author  MCD Application Team
;* @brief   STM32H7B3xx devices vector table for EWARM toolchain.
;*           This module performs:
;*           - Set the initial SP
;*           - Set the initial PC == _iar_program_start,
;*           - Set the vector table entries with the exceptions ISR
;*           address.
;*           - Branches to main in the C library (which eventually
;*           calls main()).
;*           After Reset the Cortex-M processor is in Thread mode,
;*           priority is Privileged, and the Stack is set to Main.
;*******************************************************************************
;* @attention
;*
;* Copyright (c) 2019 STMicroelectronics.
;* All rights reserved.
;*
;* This software is licensed under terms that can be found in the LICENSE file
;* in the root directory of this software component.
;* If no LICENSE file comes with this software, it is provided AS-IS.
;*
;*******************************************************************************
;
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table

        DATA
__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler                     ; Reset Handler

        DCD     NMI_Handler                       ; NMI Handler
        DCD     HardFault_Handler                 ; Hard Fault Handler
        DCD     MemManage_Handler                 ; MPU Fault Handler
        DCD     BusFault_Handler                  ; Bus Fault Handler
        DCD     UsageFault_Handler                ; Usage Fault Handler
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     SVC_Handler                       ; SVCall Handler
        DCD     DebugMon_Handler                  ; Debug Monitor Handler
        DCD     0                                 ; Reserved
        DCD     PendSV_Handler                    ; PendSV Handler
        DCD     SysTick_Handler                   ; SysTick Handler

        ; External Interrupts
        DCD     WWDG_IRQHandler                   ; Window WatchDog Interrupt
        DCD     PVD_PVM_IRQHandler                ; PVD/PVM through EXTI Line detection
        DCD     RTC_TAMP_STAMP_CSS_LSE_IRQHandler ; Tamper and TimeStamps through the EXTI line
        DCD     RTC_WKUP_IRQHandler               ; RTC Wakeup through the EXTI line
        DCD     FLASH_IRQHandler                  ; FLASH
        DCD     RCC_IRQHandler                    ; RCC
        DCD     EXTI0_IRQHandler                  ; EXTI Line0
        DCD     EXTI1_IRQHandler                  ; EXTI Line1
        DCD     EXTI2_IRQHandler                  ; EXTI Line2
        DCD     EXTI3_IRQHandler                  ; EXTI Line3
        DCD     EXTI4_IRQHandler                  ; EXTI Line4
        DCD     DMA1_Stream0_IRQHandler           ; DMA1 Stream 0
        DCD     DMA1_Stream1_IRQHandler           ; DMA1 Stream 1
        DCD     DMA1_Stream2_IRQHandler           ; DMA1 Stream 2
        DCD     DMA1_Stream3_IRQHandler           ; DMA1 Stream 3
        DCD     DMA1_Stream4_IRQHandler           ; DMA1 Stream 4
        DCD     DMA1_Stream5_IRQHandler           ; DMA1 Stream 5
        DCD     DMA1_Stream6_IRQHandler           ; DMA1 Stream 6
        DCD     ADC_IRQHandler                    ; ADC1, ADC2
        DCD     FDCAN1_IT0_IRQHandler             ; FDCAN1 interrupt line 0
        DCD     FDCAN2_IT0_IRQHandler             ; FDCAN2 interrupt line 0
        DCD     FDCAN1_IT1_IRQHandler             ; FDCAN1 interrupt line 1
        DCD     FDCAN2_IT1_IRQHandler             ; FDCAN2 interrupt line 1
        DCD     EXTI9_5_IRQHandler                ; External Line[9:5]s
        DCD     TIM1_BRK_IRQHandler               ; TIM1 Break interrupt
        DCD     TIM1_UP_IRQHandler                ; TIM1 Update
        DCD     TIM1_TRG_COM_IRQHandler           ; TIM1 Trigger and Commutation Interrupt
        DCD     TIM1_CC_IRQHandler                ; TIM1 Capture Compare
        DCD     TIM2_IRQHandler                   ; TIM2
        DCD     TIM3_IRQHandler                   ; TIM3
        DCD     TIM4_IRQHandler                   ; TIM4
        DCD     I2C1_EV_IRQHandler                ; I2C1 Event
        DCD     I2C1_ER_IRQHandler                ; I2C1 Error
        DCD     I2C2_EV_IRQHandler                ; I2C2 Event
        DCD     I2C2_ER_IRQHandler                ; I2C2 Error
        DCD     SPI1_IRQHandler                   ; SPI1
        DCD     SPI2_IRQHandler                   ; SPI2
        DCD     USART1_IRQHandler                 ; USART1
        DCD     USART2_IRQHandler                 ; USART2
        DCD     USART3_IRQHandler                 ; USART3
        DCD     EXTI15_10_IRQHandler              ; External Line[15:10]
        DCD     RTC_Alarm_IRQHandler              ; RTC Alarm (A and B) through EXTI Line
        DCD     DFSDM2_IRQHandler                 ; DFSDM2 Interrupt
        DCD     TIM8_BRK_TIM12_IRQHandler         ; TIM8 Break Interrupt and TIM12 global interrupt
        DCD     TIM8_UP_TIM13_IRQHandler          ; TIM8 Update Interrupt and TIM13 global interrupt
        DCD     TIM8_TRG_COM_TIM14_IRQHandler     ; TIM8 Trigger and Commutation Interrupt and TIM14 glob
        DCD     TIM8_CC_IRQHandler                ; TIM8 Capture Compare Interrupt
        DCD     DMA1_Stream7_IRQHandler           ; DMA1 Stream7
        DCD     FMC_IRQHandler                    ; FMC
        DCD     SDMMC1_IRQHandler                 ; SDMMC1
        DCD     TIM5_IRQHandler                   ; TIM5
        DCD     SPI3_IRQHandler                   ; SPI3
        DCD     UART4_IRQHandler                  ; UART4
        DCD     UART5_IRQHandler                  ; UART5
        DCD     TIM6_DAC_IRQHandler               ; TIM6 and DAC1&2 underrun errors
        DCD     TIM7_IRQHandler                   ; TIM7
        DCD     DMA2_Stream0_IRQHandler           ; DMA2 Stream 0
        DCD     DMA2_Stream1_IRQHandler           ; DMA2 Stream 1
        DCD     DMA2_Stream2_IRQHandler           ; DMA2 Stream 2
        DCD     DMA2_Stream3_IRQHandler           ; DMA2 Stream 3
        DCD     DMA2_Stream4_IRQHandler           ; DMA2 Stream 4
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     FDCAN_CAL_IRQHandler              ; FDCAN calibration unit interrupt
        DCD     DFSDM1_FLT4_IRQHandler            ; DFSDM Filter4 Interrupt
        DCD     DFSDM1_FLT5_IRQHandler            ; DFSDM Filter5 Interrupt
        DCD     DFSDM1_FLT6_IRQHandler            ; DFSDM Filter6 Interrupt
        DCD     DFSDM1_FLT7_IRQHandler            ; DFSDM Filter7 Interrupt
        DCD     DMA2_Stream5_IRQHandler           ; DMA2 Stream 5
        DCD     DMA2_Stream6_IRQHandler           ; DMA2 Stream 6
        DCD     DMA2_Stream7_IRQHandler           ; DMA2 Stream 7
        DCD     USART6_IRQHandler                 ; USART6
        DCD     I2C3_EV_IRQHandler                ; I2C3 event
        DCD     I2C3_ER_IRQHandler                ; I2C3 error
        DCD     OTG_HS_EP1_OUT_IRQHandler         ; USB OTG HS End Point 1 Out
        DCD     OTG_HS_EP1_IN_IRQHandler          ; USB OTG HS End Point 1 In
        DCD     OTG_HS_WKUP_IRQHandler            ; USB OTG HS Wakeup through EXTI
        DCD     OTG_HS_IRQHandler                 ; USB OTG HS
        DCD     DCMI_PSSI_IRQHandler              ; DCMI, PSSI
        DCD     CRYP_IRQHandler                   ; CRYP crypto global interrupt
        DCD     HASH_RNG_IRQHandler               ; HASH, RNG
        DCD     FPU_IRQHandler                    ; FPU
        DCD     UART7_IRQHandler                  ; UART7
        DCD     UART8_IRQHandler                  ; UART8
        DCD     SPI4_IRQHandler                   ; SPI4
        DCD     SPI5_IRQHandler                   ; SPI5
        DCD     SPI6_IRQHandler                   ; SPI6
        DCD     SAI1_IRQHandler                   ; SAI1
        DCD     LTDC_IRQHandler                   ; LTDC
        DCD     LTDC_ER_IRQHandler                ; LTDC error
        DCD     DMA2D_IRQHandler                  ; DMA2D
        DCD     SAI2_IRQHandler                   ; SAI2
        DCD     OCTOSPI1_IRQHandler               ; OCTOSPI1
        DCD     LPTIM1_IRQHandler                 ; LPTIM1
        DCD     CEC_IRQHandler                    ; HDMI_CEC
        DCD     I2C4_EV_IRQHandler                ; I2C4 Event
        DCD     I2C4_ER_IRQHandler                ; I2C4 Error
        DCD     SPDIF_RX_IRQHandler               ; SPDIF_RX
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     0                                 ; Reserved
        DCD     DMAMUX1_OVR_IRQHandler            ; DMAMUX1 Overrun interrupt
        DCD     0                                 ;  Reserved
        DCD     0                                 ;  Reserved
        DCD     0                                 ;  Reserved
        DCD     0                                 ;  Reserved
        DCD     0                                 ;  Reserved
        DCD     0                                 ;  Reserved
        DCD     0                                 ;  Reserved
        DCD     DFSDM1_FLT0_IRQHandler            ; DFSDM Filter0 Interrupt
        DCD     DFSDM1_FLT1_IRQHandler            ; DFSDM Filter1 Interrupt
        DCD     DFSDM1_FLT2_IRQHandler            ; DFSDM Filter2 Interrupt
        DCD     DFSDM1_FLT3_IRQHandler            ; DFSDM Filter3 Interrupt
        DCD     0                                 ;  Reserved
        DCD     SWPMI1_IRQHandler                 ;  Serial Wire Interface 1 global interrupt
        DCD     TIM15_IRQHandler                  ;  TIM15 global Interrupt
        DCD     TIM16_IRQHandler                  ;  TIM16 global Interrupt
        DCD     TIM17_IRQHandler                  ;  TIM17 global Interrupt
        DCD     MDIOS_WKUP_IRQHandler             ;  MDIOS Wakeup  Interrupt
        DCD     MDIOS_IRQHandler                  ;  MDIOS global Interrupt
        DCD     JPEG_IRQHandler                   ;  JPEG global Interrupt
        DCD     MDMA_IRQHandler                   ;  MDMA global Interrupt
        DCD     0                                 ;  Reserved
        DCD     SDMMC2_IRQHandler                 ;  SDMMC2 global Interrupt
        DCD     HSEM1_IRQHandler                  ;  HSEM1 global Interrupt
        DCD     0                                 ;  Reserved
        DCD     DAC2_IRQHandler                   ;  DAC2 global Interrupt
        DCD     DMAMUX2_OVR_IRQHandler            ; DMAMUX Overrun interrupt
        DCD     BDMA2_Channel0_IRQHandler         ;  BDMA Channel 0 global Interrupt
        DCD     BDMA2_Channel1_IRQHandler         ;  BDMA Channel 1 global Interrupt
        DCD     BDMA2_Channel2_IRQHandler         ;  BDMA Channel 2 global Interrupt
        DCD     BDMA2_Channel3_IRQHandler         ;  BDMA Channel 3 global Interrupt
        DCD     BDMA2_Channel4_IRQHandler         ;  BDMA Channel 4 global Interrupt
        DCD     BDMA2_Channel5_IRQHandler         ;  BDMA Channel 5 global Interrupt
        DCD     BDMA2_Channel6_IRQHandler         ;  BDMA Channel 6 global Interrupt
        DCD     BDMA2_Channel7_IRQHandler         ;  BDMA Channel 7 global Interrupt
        DCD     COMP_IRQHandler                   ;  COMP global Interrupt
        DCD     LPTIM2_IRQHandler                 ;  LP TIM2 global interrupt
        DCD     LPTIM3_IRQHandler                 ;  LP TIM3 global interrupt
        DCD     UART9_IRQHandler                  ;  UART9 global interrupt
        DCD     USART10_IRQHandler                ;  USART10 global interrupt
        DCD     LPUART1_IRQHandler                ;  LP UART1 interrupt
        DCD     0                                 ; Reserved
        DCD     CRS_IRQHandler                    ; Clock Recovery Global Interrupt
        DCD     ECC_IRQHandler                    ; ECC
        DCD     0                                 ; Reserved
        DCD     DTS_IRQHandler                    ; DTS
        DCD     0                                 ; Reserved
        DCD     WAKEUP_PIN_IRQHandler             ;  Interrupt for all 6 wake-up pins
        DCD     OCTOSPI2_IRQHandler               ; OCTOSPI2
        DCD     OTFDEC1_IRQHandler                ; OTFDEC1
        DCD     OTFDEC2_IRQHandler                ; OTFDEC2
        DCD     GFXMMU_IRQHandler                 ; GFXMMU
        DCD     BDMA1_IRQHandler                  ; BDMA1
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB
        PUBWEAK Reset_Handler
        SECTION .text:CODE:NOROOT:REORDER(2)
Reset_Handler

        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
NMI_Handler
        B NMI_Handler

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
HardFault_Handler
        B HardFault_Handler

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
MemManage_Handler
        B MemManage_Handler

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
BusFault_Handler
        B BusFault_Handler

